Revit 2026 API

# Reference Constructor

---

Creates a Reference with the supplied element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference(
	Element element
)
```
```vb
Public Sub New (
	element As Element
)
```
```cpp
public:
Reference(
	Element^ element
)
```
```fsharp
new :
        element : Element -> Reference
```

#### Parameters

element Element
    The element to create a reference.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the parameter is . |

#### Reference

Reference Class

Autodesk.Revit.DB Namespace